[
  {
    "title": "Разработать систему показа тестовых работ",
    "description": "Задача: <br/>Для демонстрации навыков был реализован <b>этот карточный проект</b>, имитирующий задачу создания MVP системы.<br/>Цели разработки: <br/>- Ограничение времени на выполнение — не более двух вечеров.<br/>- Отказ от использования стороннего дизайна.<br/>- Реализация приложения как единой системы на основном стеке (React + TypeScript).",
    "href": "#",
    "cardName": "main",
    "tags": ["Верстка", "mvp", "antd", "fsd"],
    "time": "12 часов"
  },
  {
    "title": "Верстка формы, фильтрация",
    "description": "Задача: <br />- Осуществить верстку по предоставленному макету JPG (без исходника)<br />- Добавить рендер карточек исходя из данных json объекта<br />- Добавить фильтрацию карточек, в зависимости от нажатых  чекбоксов<br />- Добавить конвертацию валюты по курсе: 1 доллар = 50 рублей, 1 евро = 55 рублей",
    "href": "#",
    "cardName": "1",
    "tags": ["Верстка", "Фильтрация", "onlyWeb"],
    "time": "6.5 часа"
  },
  {
    "title": "Форма, валидация полей",
    "description": "Задача: <br />- Реализовать демонстрацию приемов валидации полей ввода<br />",
    "href": "#",
    "cardName": "2",
    "tags": ["Валидация"],
    "time": "2 часа"
  },
  {
    "title": "Cookies, контроллер состояний",
    "description": "Разработать систему управления состояниями интерфейса по средствам работы с cookies файлами",
    "href": "#",
    "cardName": "3",
    "tags": ["Cookies"],
    "time": "1 час"
  },
  {
    "title": "Redux",
    "description": "Подключить пространство контекста через Redux",
    "href": "#",
    "cardName": "4",
    "tags": ["Redux"],
    "time": "4 часа"
  },
  {
    "title": "Заполнение и анализ данных",
    "description": "На фрилансе пришла новая задача.<br />Цель задачи состоит в том, что бы собрать две раздельных компоненты, которые будут работать с одними и теми же состояниями на одной странице. При этом на лету осуществляется математический анализ введенных данных. В данной реализации я опускаю моменты чтения и записи данных из БД, а так же точное отражение самой задачи по функционалу. Показываю только основной принцип того, как это может работать.",
    "href": "#",
    "cardName": "5",
    "tags": ["Компонента", "Redux", "DRY"],
    "time": "7 часов"
  },
  {
    "title": "Websocket",
    "description": "В качестве тестов необходимо посмотреть как работают WebSocet.",
    "href": "#",
    "cardName": "6",
    "tags": ["Websocket"],
    "time": "3 часа"
  },
  {
    "title": "Изолированный виджет с drag drop механикой и тройной вложенностью структуры",
    "description": "Поступила новая задача — необходимо разработать функциональный изолированный React-компонент на основе наброска от клиента. Ключевая сложность заключается в том, что все элементы структуры должны поддерживать перетаскивание (DND) и при этом строго соответствовать логике, описанной клиентом. Кроме того, все управляющие функции должны быть вынесены в Redux-слой, что исключает использование локального состояния внутри компонента. Взаимодействие с данными, изменение порядка элементов и их обработка должны полностью управляться через Redux, обеспечивая гибкость и предсказуемость работы. Важно, чтобы компонент оставался независимым.",
    "href": ".",
    "cardName": "7",
    "tags": ["DND-kit", "Redux"],
    "time": "24 часа"
  }
]
