[
  {
    "title": "Разработать систему показа тестовых работ",
    "description": "Задача: <br/>Для демонстрации навыков был реализован <b>этот карточный проект</b>, имитирующий задачу создания MVP системы.<br/>Цели разработки: <br/>- Ограничение времени на выполнение — не более двух вечеров.<br/>- Отказ от использования стороннего дизайна.<br/>- Реализация приложения как единой системы на основном стеке (React + TypeScript).",
    "href": "#",
    "cardName": "main",
    "tags": ["Верстка", "mvp", "antd", "fsd"],
    "time": "12 часов"
  },
  {
    "title": "Верстка формы, фильтрация",
    "description": "Задача: <br />- Осуществить верстку по предоставленному макету JPG (без исходника)<br />- Добавить рендер карточек исходя из данных json объекта<br />- Добавить фильтрацию карточек, в зависимости от нажатых  чекбоксов<br />- Добавить конвертацию валюты по курсе: 1 доллар = 50 рублей, 1 евро = 55 рублей",
    "imgSrc": "__task1",
    "href": "#",
    "cardName": "1",
    "tags": ["Верстка", "Тестовое"],
    "time": "6.5 часа"
  },
  {
    "title": "Форма, валидация полей",
    "description": "Задача: <br />- Реализовать демонстрацию приемов валидации полей ввода<br />",
    "imgSrc": "__task2",
    "href": "#",
    "cardName": "2",
    "tags": ["Валидация"],
    "time": "2 часа"
  },
  {
    "title": "Cookies, контроллер состояний",
    "description": "Разработать систему управления состояниями интерфейса по средствам работы с cookies файлами",
    "imgSrc": "__task3",
    "href": "#",
    "cardName": "3",
    "tags": ["Cookies"],
    "time": "1 час"
  },
  {
    "title": "Redux",
    "description": "Подключить пространство контекста через Redux",
    "href": "#",
    "cardName": "4",
    "tags": ["Redux"],
    "time": "4 часа"
  },
  {
    "title": "Заполнение и анализ данных",
    "description": "На фрилансе пришла новая задача.<br />Цель задачи состоит в том, что бы собрать две раздельных компоненты, которые будут работать с одними и теми же состояниями на одной странице. При этом на лету осуществляется математический анализ введенных данных. В данной реализации я опускаю моменты чтения и записи данных из БД, а так же точное отражение самой задачи по функционалу. Показываю только основной принцип того, как это может работать.",
    "imgSrc": "__task5",
    "href": "#",
    "cardName": "5",
    "tags": ["Компонента", "Redux", "DRY"],
    "time": "7 часов"
  },
  {
    "title": "Websocket",
    "description": "В качестве тестов необходимо посмотреть как работают WebSocet.",
    "imgSrc": "__task6",
    "href": "#",
    "cardName": "6",
    "tags": ["Websocket"],
    "time": "3 часа"
  },
  {
    "title": "Изолированный виджет с drag drop механикой и тройной вложенностью структуры",
    "description": "Поступила новая задача — необходимо разработать функциональный изолированный React-компонент на основе наброска от клиента. Ключевая сложность заключается в том, что все элементы структуры должны поддерживать перетаскивание (DND) и при этом строго соответствовать логике, описанной клиентом. Кроме того, все управляющие функции должны быть вынесены в Redux-слой, что исключает использование локального состояния внутри компонента. Взаимодействие с данными, изменение порядка элементов и их обработка должны полностью управляться через Redux, обеспечивая гибкость и предсказуемость работы. Важно, чтобы компонент оставался независимым.",
    "imgSrc": "__task7",
    "href": ".",
    "cardName": "7",
    "tags": ["DND-kit", "Redux"],
    "time": "24 часа"
  },
  {
    "title": "Верстка адаптивного html шалона",
    "description": "Верстка шаблона под размер от 320 до 1440 пикселей",
    "imgSrc": "__task8",
    "href": ".",
    "cardName": "8",
    "tags": ["Верстка"],
    "time": "24 часа"
  },
  {
    "title": "Тестовое задание",
    "description": "Необходимо сделать вывод параметров модели по клику на кнопку. Так же должены быть Input поля, в которых можно изменить параметры модели. Так же необходимо учесть, что должна быть определенная простота при добавлении новыйх параметров данной модели в коде",
    "imgSrc": "__task9",
    "href": ".",
    "cardName": "9",
    "tags": ["Тестовое"],
    "time": "~ 2 часа"
  },
  {
    "title": "Портфель html баннеров",
    "description": "В качестве демонстрации навыков разработки анимированных HTML-баннеров была создана страница с портфлем работ, разработанных в программе Adobe Animate CC",
    "imgSrc": "__banners",
    "href": ".",
    "cardName": "banners",
    "tags": ["html баннеры"],
    "time": "-"
  },
  {
    "title": "Разработка главной страницы ИМ",
    "description": "Разработана главная страница интернет-магазина с применением FSD-архитектуры для модульной структуры компонентов, Redux для централизованного управления состоянием и Webpack с декомпозированной конфигурацией для оптимизированной сборки. Реализована адаптивная вёрстка и кастомные UI-компоненты, включая слайдер с кроссплатформенной поддержкой.",
    "imgSrc": "__task10",
    "href": ".",
    "cardName": "10",
    "tags": ["Верстка", "fsd", "Redux"],
    "time": "~ 32 часа"
  }
]
